[
  {
    "id": 1,
    "nome": "Heracross",
    "tipos": ["Inseto", "Lutador"],
    "altura_m": 1.5,
    "peso_kg": 54.0,
    "habilidades": [
      { "nome": "Swarm", "escondida": false },
      { "nome": "Guts", "escondida": false }
    ],
    "estatisticas_base": {
      "hp": 80,
      "ataque": 125,
      "defesa": 75,
      "ataque_especial": 40,
      "defesa_especial": 95,
      "velocidade": 85
    },
    "descricao": "Este é um Pokémon Inseto/Lutador conhecido por seu poderoso chifre. É herbívoro, mas pode levantar objetos que pesam 100 vezes o seu próprio peso. Se encontrar um, certifique-se de ter mel à mão!",
    "imagem_url": "imagens/heracross.png"
  },
  {
    "id": 2,
    "nome": "Gengar",
    "tipos": ["Fantasma", "Venenoso"],
    "altura_m": 1.5,
    "peso_kg": 40.5,
    "habilidades": [
      { "nome": "Cursed Body", "escondida": false }
    ],
    "estatisticas_base": {
      "hp": 60,
      "ataque": 65,
      "defesa": 60,
      "ataque_especial": 130,
      "defesa_especial": 75,
      "velocidade": 110
    },
    "descricao": "Este é um Pokémon do tipo Fantasma/Veneno conhecido por sua natureza travessa e um sorriso malicioso. Ele se esconde nas sombras das pessoas, absorvendo seu calor e causando um arrepio repentino. Dizem que, às vezes, ele tenta levar a vida de suas vítimas, espreitando em suas sombras.",
    "imagem_url": "imagens/gengar.png"
  },
  {
    "id": 3,
    "nome": "Dragonite",
    "tipos": ["Dragão", "Voador"],
    "altura_m": 2.2,
    "peso_kg": 210.0,
    "habilidades": [
      { "nome": "Inner Focus", "escondida": false },
      { "nome": "Multiscale", "escondida": true }
    ],
    "estatisticas_base": {
      "hp": 91,
      "ataque": 134,
      "defesa": 95,
      "ataque_especial": 100,
      "defesa_especial": 100,
      "velocidade": 80
    },
    "descricao": "Este é um Pokémon do tipo Dragão/Voador conhecido por sua natureza bondosa e por resgatar pessoas no mar. Apesar de seu tamanho robusto, ele pode dar a volta ao mundo em apenas 16 horas. É a encarnação da inteligência marinha, guiando navios perdidos em meio a tempestades. Incorra a ira deste Pokémon calmo por sua conta e risco!",
    "imagem_url": "imagens/dragonite.png"
  },
  {
    "id": 4,
    "nome": "Raichu",
    "tipos": ["Elétrico"],
    "altura_m": 0.8,
    "peso_kg": 30.0,
    "habilidades": [
      { "nome": "Static", "escondida": false },
      { "nome": "Lightning Rod", "escondida": true }
    ],
    "estatisticas_base": {
      "hp": 60,
      "ataque": 90,
      "defesa": 55,
      "ataque_especial": 90,
      "defesa_especial": 80,
      "velocidade": 110
    },
    "descricao": "Este é um Pokémon Rato do tipo Elétrico que pode liberar choques de 100.000 volts, o suficiente para nocautear um elefante. Quando agitado e com excesso de eletricidade acumulada em seu corpo, ele se torna mais agressivo. Para se proteger de sua própria carga, ele planta sua cauda no chão para descarregar a energia.",
    "imagem_url": "imagens/raichu.png"
  },
  {
    "id": 5,
    "nome": "Sylveon",
    "tipos": ["Fada"],
    "altura_m": 1.0,
    "peso_kg": 23.5,
    "habilidades": [
      { "nome": "Cute Charm", "escondida": false },
      { "nome": "Pixilate", "escondida": true }
    ],
    "estatisticas_base": {
      "hp": 95,
      "ataque": 65,
      "defesa": 65,
      "ataque_especial": 110,
      "defesa_especial": 130,
      "velocidade": 60
    },
    "descricao": "Este é um Pokémon do tipo Fada e uma das evoluções do Eevee. Ele utiliza suas fitas sensoriais para envolver o braço de seu Treinador, lendo seus sentimentos. É conhecido por emitir uma aura calmante através dessas fitas, neutralizando hostilidade e parando conflitos. É uma criatura gentil, mas ataca o ponto fraco dos adversários sem hesitar.",
    "imagem_url": "imagens/sylveon.png"
  },
  {
    "id": 6,
    "nome": "Machamp",
    "tipos": ["Lutador"],
    "altura_m": 1.6,
    "peso_kg": 130.0,
    "habilidades": [
      { "nome": "Guts", "escondida": false },
      { "nome": "No Guard", "escondida": false }
    ],
    "estatisticas_base": {
      "hp": 90,
      "ataque": 130,
      "defesa": 80,
      "ataque_especial": 65,
      "defesa_especial": 85,
      "velocidade": 55
    },
    "descricao": "Este é um Pokémon do tipo Lutador conhecido por sua força imensa e seus quatro braços. Dizem que ele dominou todas as artes marciais do mundo e pode desferir 1.000 socos em apenas dois segundos. Sua força é tanta que ele pode arremessar oponentes para além do horizonte ou carregar um navio, mas suas mãos são muito desajeitadas para qualquer trabalho delicado.",
    "imagem_url": "imagens/machomp.png"
  },
  {
    "id": 7,
    "nome": "Charizard",
    "tipos": ["Fogo", "Voador"],
    "altura_m": 1.7,
    "peso_kg": 90.5,
    "habilidades": [
      { "nome": "Blaze", "escondida": false },
      { "nome": "Solar Power", "escondida": true }
    ],
    "estatisticas_base": {
      "hp": 78,
      "ataque": 84,
      "defesa": 78,
      "ataque_especial": 109,
      "defesa_especial": 85,
      "velocidade": 100
    },
    "descricao": "Este é um Pokémon do tipo Fogo/Voador conhecido por sua aparência dracônica e pela força de suas chamas. Ele voa pelos céus procurando por oponentes poderosos e sua respiração de fogo é tão quente que pode derreter pedras. No entanto, ele nunca usará seu sopro flamejante contra um inimigo mais fraco que ele. A chama em sua cauda arde com mais intensidade quando ele está em uma batalha intensa.",
    "imagem_url": "imagens/charizard.png"
  },
  {
    "id": 8,
    "nome": "Pidgeot",
    "tipos": ["Normal", "Voador"],
    "altura_m": 1.5,
    "peso_kg": 39.5,
    "habilidades": [
      { "nome": "Keen Eye", "escondida": false },
      { "nome": "Tangled Feet", "escondida": false }
    ],
    "estatisticas_base": {
      "hp": 83,
      "ataque": 80,
      "defesa": 75,
      "ataque_especial": 70,
      "defesa_especial": 70,
      "velocidade": 101
    },
    "descricao": "Este é um Pokémon Pássaro do tipo Normal/Voador conhecido por sua beleza e velocidade. Ele desliza pelos céus a uma velocidade Mach 2 (o dobro da velocidade do som) em busca de presas. Muitos treinadores são cativados pela impressionante beleza de suas plumas na cabeça. Seus músculos peitorais são tão fortes que ele pode criar uma tempestade de vento com apenas algumas batidas de asas.",
    "imagem_url": "imagens/pidgeot.png"
  },
  {
    "id": 9,
    "nome": "Banette",
    "tipos": ["Fantasma"],
    "altura_m": 1.1,
    "peso_kg": 12.5,
    "habilidades": [
      { "nome": "Insomnia", "escondida": false },
      { "nome": "Frisk", "escondida": false }
    ],
    "estatisticas_base": {
      "hp": 64,
      "ataque": 115,
      "defesa": 65,
      "ataque_especial": 83,
      "defesa_especial": 63,
      "velocidade": 65
    },
    "descricao": "Este é um Pokémon Marionete do tipo Fantasma que foi um boneco de pelúcia abandonado e ganhou vida devido a um rancor profundo. Ele usa seu corpo como um boneco vodu, enfiando alfinetes em si mesmo para lançar maldições. O zíper que atua como sua boca mantém sua energia amaldiçoada segura, e se for aberto, ele a perderá. Ele perambula por becos e lixeiras procurando pela criança que o jogou fora.",
    "imagem_url": "imagens/banette.png"
  },
  {
    "id": 10,
    "nome": "Sceptile",
    "tipos": ["Grama"],
    "altura_m": 1.7,
    "peso_kg": 52.2,
    "habilidades": [
      { "nome": "Overgrow", "escondida": false },
      { "nome": "Unburden", "escondida": true }
    ],
    "estatisticas_base": {
      "hp": 70,
      "ataque": 85,
      "defesa": 65,
      "ataque_especial": 105,
      "defesa_especial": 85,
      "velocidade": 120
    },
    "descricao": "Este é um Pokémon Floresta do tipo Grama que se move com agilidade inigualável pela selva. As folhas em seus braços são afiadas como espadas, usadas para fatiar árvores grossas e abater a presa. Suas esferas nas costas contêm nutrientes que revitalizam as árvores. Quando Mega Evolui, ele ganha o tipo Dragão e pode disparar parte de sua cauda como um míssil.",
    "imagem_url": "imagens/sceptile.png"
  },
  {
    "id": 11,
    "nome": "Donphan",
    "tipos": ["Terra"],
    "altura_m": 1.1,
    "peso_kg": 120.0,
    "habilidades": [
      { "nome": "Sturdy", "escondida": false },
      { "nome": "Sand Veil", "escondida": true }
    ],
    "estatisticas_base": {
      "hp": 90,
      "ataque": 120,
      "defesa": 120,
      "ataque_especial": 60,
      "defesa_especial": 60,
      "velocidade": 50
    },
    "descricao": "Este é um Pokémon Blindado do tipo Terra, conhecido por sua pele dura como rocha que o protege de ataques comuns e até mesmo de um carro. Seu ataque favorito é se enrolar em uma bola e rolar em alta velocidade em direção ao inimigo, podendo derrubar uma casa com uma única investida! O comprimento de suas presas determina sua classificação dentro do seu bando.",
    "imagem_url": "imagens/donphan.png"
  },
  {
    "id": 12,
    "nome": "Lapras",
    "tipos": ["Água", "Gelo"],
    "altura_m": 2.5,
    "peso_kg": 220.0,
    "habilidades": [
      { "nome": "Water Absorb", "escondida": false },
      { "nome": "Shell Armor", "escondida": false }
    ],
    "estatisticas_base": {
      "hp": 130,
      "ataque": 85,
      "defesa": 80,
      "ataque_especial": 85,
      "defesa_especial": 95,
      "velocidade": 60
    },
    "descricao": "Este é um Pokémon Transporte do tipo Água/Gelo conhecido por sua natureza gentil e alta inteligência, sendo capaz de entender a fala humana. Ele adora nadar no mar com pessoas em suas costas, oferecendo uma viagem muito confortável. Devido à sua docilidade, foi caçado quase até a extinção, e à noite, dizem que ele canta uma melodia melancólica enquanto procura por outros de sua espécie.",
    "imagem_url": "imagens/lapras.png"
  },
  {
    "id": 13,
    "nome": "Snorlax",
    "tipos": ["Normal"],
    "altura_m": 2.1,
    "peso_kg": 460.0,
    "habilidades": [
      { "nome": "Immunity", "escondida": false },
      { "nome": "Thick Fat", "escondida": false }
    ],
    "estatisticas_base": {
      "hp": 160,
      "ataque": 110,
      "defesa": 65,
      "ataque_especial": 65,
      "defesa_especial": 110,
      "velocidade": 30
    },
    "descricao": "Este é um Pokémon Dorminhoco do tipo Normal que é famoso por sua preguiça: ele só come e dorme, devorando quase 400 kg de comida por dia! Seu estômago é tão forte que ele pode digerir qualquer alimento, mesmo que esteja mofado ou podre, e o veneno de um Muk não passa de um tempero. Quando está com a barriga cheia, fica tão letárgico que nem consegue levantar um dedo, tornando-se um lugar seguro para as crianças brincarem. Geralmente, a única forma de acordá-lo é com uma Poké Flauta.",
    "imagem_url": "imagens/snorlax.png"
  },
  {
    "id": 14,
    "nome": "Muk",
    "tipos": ["Venenoso"],
    "altura_m": 1.2,
    "peso_kg": 30.0,
    "habilidades": [
      { "nome": "Stench", "escondida": false },
      { "nome": "Sticky Hold", "escondida": false }
    ],
    "estatisticas_base": {
      "hp": 105,
      "ataque": 105,
      "defesa": 75,
      "ataque_especial": 65,
      "defesa_especial": 100,
      "velocidade": 50
    },
    "descricao": "Este é um Pokémon Lodo do tipo Veneno coberto por uma imunda e viscosa lama. Ele exala um cheiro horrendo que pode causar desmaios e é tão tóxico que até mesmo suas pegadas contêm veneno capaz de matar plantas. Uma única gota do fluido de seu corpo pode tornar um lago inteiro estagnado e rançoso. Ele ama se alimentar de tudo que é repugnantemente sujo.",
    "imagem_url": "imagens/muk.png"
  },
  {
    "id": 15,
    "nome": "Mewtwo",
    "tipos": ["Psíquico"],
    "altura_m": 2.0,
    "peso_kg": 122.0,
    "habilidades": [
      { "nome": "Pressure", "escondida": false },
      { "nome": "Unnerve", "escondida": true }
    ],
    "estatisticas_base": {
      "hp": 106,
      "ataque": 110,
      "defesa": 90,
      "ataque_especial": 154,
      "defesa_especial": 90,
      "velocidade": 130
    },
    "descricao": "Este é um Pokémon Genético do tipo Psíquico, criado por anos de horríveis experimentos para ser o Pokémon mais forte do mundo. Sua inteligência é superior à dos humanos e ele possui um poder mental avassalador, capaz de esmagar um arranha-céu com um mero pensamento. Ele pode se comunicar por telepatia e conserva sua energia até enfrentar um oponente que considere digno.\n\nCuriosamente, ele pode Mega Evoluir para duas formas: Mega Mewtwo X (Psíquico/Lutador) e Mega Mewtwo Y (Psíquico).",
    "imagem_url": "imagens/mewtwo.png"
  },
  {
    "id": 16,
    "nome": "Onix",
    "tipos": ["Pedra", "Terra"],
    "altura_m": 8.8,
    "peso_kg": 210.0,
    "habilidades": [
      { "nome": "Rock Head", "escondida": false },
      { "nome": "Sturdy", "escondida": false }
    ],
    "estatisticas_base": {
      "hp": 35,
      "ataque": 45,
      "defesa": 160,
      "ataque_especial": 30,
      "defesa_especial": 45,
      "velocidade": 70
    },
    "descricao": "Este é um Pokémon Serpente de Pedra dos tipos Pedra/Terra, conhecido por seu corpo enorme, composto por pedras que endurecem com o tempo, tornando-se parecidas com diamante. Ele cava túneis no subsolo girando e contorcendo seu corpo a uma velocidade de 80 km/h, alimentando-se de rochas à medida que avança. Dizem que ele tem um ímã no cérebro que o impede de perder a direção enquanto está tunelando. Os túneis que ele deixa para trás são frequentemente usados por outros Pokémon, como o Diglett, como casas.",
    "imagem_url": "imagens/onix.png"
  },
  {
    "id": 17,
    "nome": "Aggron",
    "tipos": ["Aço", "Pedra"],
    "altura_m": 2.1,
    "peso_kg": 360.0,
    "habilidades": [
      { "nome": "Sturdy", "escondida": false },
      { "nome": "Rock Head", "escondida": false }
    ],
    "estatisticas_base": {
      "hp": 70,
      "ataque": 110,
      "defesa": 180,
      "ataque_especial": 60,
      "defesa_especial": 60,
      "velocidade": 50
    },
    "descricao": "Este é um Pokémon Blindado de Ferro dos tipos Aço/Pedra, conhecido por sua defesa física e por ser extremamente territorial. Ele reivindica uma montanha inteira como seu território e ataca impiedosamente qualquer um que ouse invadir. Sua armadura é tão resistente que ele pode demolir um caminhão de lixo com uma única investida. Ele patrulha vigilantemente seu território, e caso ele seja devastado por incêndios florestais ou deslizamentos de terra, o Aggron irá restaurá-lo, replantando árvores e levando terra.\n\nQuando Mega Evolui, ele se torna um Pokémon de tipo Aço Puro e possui uma das maiores Defesas do jogo.",
    "imagem_url": "imagens/aggron.png"
  },
  {
    "id": 18,
    "nome": "Greninja",
    "tipos": ["Água", "Sombrio"],
    "altura_m": 1.5,
    "peso_kg": 40.0,
    "habilidades": [
      { "nome": "Torrent", "escondida": false },
      { "nome": "Protean", "escondida": true }
    ],
    "estatisticas_base": {
      "hp": 72,
      "ataque": 95,
      "defesa": 67,
      "ataque_especial": 103,
      "defesa_especial": 71,
      "velocidade": 122
    },
    "descricao": "Este é um Pokémon Ninja dos tipos Água/Sombrio que se move com a graça de um ninja. Ele cria estrelas ninja (Shuriken) feitas de água superafiada, capazes de cortar cabos de aço. Ele usa sua longa língua, que enrola em seu pescoço, para sentir inimigos que não consegue ver e brinca com eles usando movimentos ágeis antes de atacá-los.\n\nSua forma especial Ash-Greninja demonstra um forte laço com seu Treinador, enquanto a recém-revelada Mega Greninja usa uma Shuriken de água gigante para atacar.",
    "imagem_url": "imagens/greninja.png"
  },
  {
    "id": 19,
    "nome": "Rayquaza",
    "tipos": ["Dragão", "Voador"],
    "altura_m": 7.0,
    "peso_kg": 207,
    "habilidades": [
      { "nome": "Air Lock", "escondida": false},
      { "nome": "Delta Stream", "escondida": false}
    ],
    "estatisticas_base": {
      "hp": 105,
      "ataque": 150,
      "defesa": 90,
      "ataque_especial": 150,
      "defesa_especial": 90,
      "velocidade": 95
    },
    "descricao": "Este é um Pokémon Lendário do Céu, do tipo Dragão/Voador, conhecido por viver na camada de ozônio do planeta, onde se alimenta de meteoroides. Por esta razão, demorou muito tempo para ser descoberto.\n\nSua lenda diz que ele pôs fim ao confronto titânico entre Kyogre e Groudon, descendo à Terra para acalmar os outros membros do Trio do Clima. Ele tem a capacidade de voar em alta velocidade e, quando Mega Evolui, não necessita de uma Mega Stone, bastando conhecer o movimento Ascensão do Dragão para atingir uma forma ainda mais poderosa. Sua Mega Evolução é notável por alterar o clima, removendo as fraquezas do tipo Voador contra movimentos Super Efetivos (Habilidade Delta Stream).",
    "imagem_url": "imagens/rayquaza.png"
  },
  {
    "id": 20,
    "nome": "Arceus",
    "tipos": ["Normal"],
    "altura_m": 3.2,
    "peso_kg": 320,
    "habilidades": [
      { "nome": "Multitipo", "escondida": false}
    ],
    "estatisticas_base": {
      "hp": 120,
      "ataque": 120,
      "defesa": 120,
      "ataque_especial": 120,
      "defesa_especial": 120,
      "velocidade": 120
    },
    "descricao": "Arceus.\nO Pokémon Alfa e criador de tudo",
    "imagem_url": "imagens/arceus.png"
  }
]